react-forum/app/controllers/api/v1/comments_controller.rb

  def set_discussion
    @discussion = Discussion.find(params[:id])
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]