react-forum/app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "discussion_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Hi this comment was elfrt by me !"], ["user_id", 1], ["discussion_id", 10], ["created_at", "2023-01-22 00:35:11.413020"], ["updated_at", "2023-01-22 00:35:11.413020"]]
---
  def create
    comment = Comment.create!(comment_params)

SELECT "comments".* FROM "comments" WHERE (discussion_id = '10') ORDER BY "comments"."created_at" DESC
---
  def show
    comments = Comment.where("discussion_id = ?", params[:discussion_id]).order(created_at: :desc)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @comment&.destroy