react-forum/app/controllers/api/v1/discussions_controller.rb

SELECT "discussions".* FROM "discussions" ORDER BY "discussions"."created_at" DESC
---
  def index
    discussion = Discussion.all.order(created_at: :desc)

INSERT INTO "discussions" ("title", "author", "body", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "johnsons and johgons"], ["author", ""], ["body", "sucks"], ["image", nil], ["created_at", "2022-12-28 21:09:00.006479"], ["updated_at", "2022-12-28 21:09:00.006479"]]
---
  def create
    discussion = Discussion.create!(discussion_params)

DELETE FROM "discussions" WHERE "discussions"."id" = ?  [["id", 36]]
---
  def destroy
    @discussion&.destroy

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def set_discussion
    @discussion = Discussion.find(params[:id])