react-forum/app/controllers/api/v1/users_controller.rb

  def create
    # user = User.create!(user_params)
    if User.exists?(:name => params[:user][:name])
      render json: User.find_by(name: params[:user][:name])
    elsif params[:user][:name] == ""
      render json: User.find_by(name: "Anon")
    else
      user = User.create!(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Aikeen"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Aikeen"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Anon"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "\"\""], ["created_at", "2023-01-25 15:37:30.202876"], ["updated_at", "2023-01-25 15:37:30.202876"]]

  def destroy
    @user&.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]